## pandas

In [272]:
import pandas as pd

In [273]:
array=[5,2,82,84,12]
series=pd.Series(array)
print(series)

0     5
1     2
2    82
3    84
4    12
dtype: int64

In [274]:
custom_series=pd.Series(array,index=["a","b","c",4,5])
print(custom_series)

a     5
b     2
c    82
4    84
5    12
dtype: int64

### dataframes

In [275]:
data={
    "name":["vaishnavi","tanuja","shreya","adil"],
    "dept":["BCA","MCA","MBA","DEVELOPER"],
    "marks":[99,88,95,97],
    "passed":[True,False,True,False]
}
df=pd.DataFrame(data)
print(df)

        name       dept  marks  passed
0  vaishnavi        BCA     99    True
1     tanuja        MCA     88   False
2     shreya        MBA     95    True
3       adil  DEVELOPER     97   False

### filtering data

high_score=df[df["marks"]>90]
print(high_score)

passed=df[df["passed"]==True]
print(passed)

# HOMEWORK

### print the first 3 rows from the dataframe

In [276]:

data={
    "name":["vaishnavi","tanuja","shreya","adil"],
    "dept":["BCA","MCA","MBA","DEVELOPER"],
    "marks":[99,88,95,97],
    "passed":[True,False,True,False],
    "subjects":["CN","OS","DBMS","HTML"]
}
df=pd.DataFrame(data)
print(df.head(3))

        name dept  marks  passed subjects
0  vaishnavi  BCA     99    True       CN
1     tanuja  MCA     88   False       OS
2     shreya  MBA     95    True     DBMS

In [277]:
data={
    "name":["vaishnavi","tanuja","shreya","adil"],
    "dept":["BCA","MCA","MBA","DEVELOPER"],
    "marks":[99,88,95,97],
    "passed":[True,False,True,False],
    "subjects":["CN","OS","DBMS","HTML"]
}
df=pd.DataFrame(data)
for i in range(3):
    print(df.iloc[i])
    print("----------")

name        vaishnavi
dept              BCA
marks              99
passed           True
subjects           CN
Name: 0, dtype: object
----------
name        tanuja
dept           MCA
marks           88
passed       False
subjects        OS
Name: 1, dtype: object
----------
name        shreya
dept           MBA
marks           95
passed        True
subjects      DBMS
Name: 2, dtype: object
----------

In [278]:
data={
    "name":["vaishnavi","tanuja","shreya","adil"],
    "dept":["BCA","MCA","MBA","DEVELOPER"],
    "marks":[99,88,95,97],
    "passed":[True,False,True,False],
    "subjects":["CN","OS","DBMS","HTML"]
}
df=pd.DataFrame(data)
i=0
while i<3:
     print(df.iloc[i])
    
     print("----------")
     i+=1

name        vaishnavi
dept              BCA
marks              99
passed           True
subjects           CN
Name: 0, dtype: object
----------
name        tanuja
dept           MCA
marks           88
passed       False
subjects        OS
Name: 1, dtype: object
----------
name        shreya
dept           MBA
marks           95
passed        True
subjects      DBMS
Name: 2, dtype: object
----------

In [279]:
data={
    "name":["vaishnavi","tanuja","shreya","adil"],
    "dept":["BCA","MCA","MBA","DEVELOPER"],
    "marks":[99,88,95,97],
    "passed":[True,False,True,False],
    "subjects":["CN","OS","DBMS","HTML"]
}
df=pd.DataFrame(data)
print(df[:3])

        name dept  marks  passed subjects
0  vaishnavi  BCA     99    True       CN
1     tanuja  MCA     88   False       OS
2     shreya  MBA     95    True     DBMS

In [280]:
data={
    "name":["vaishnavi","tanuja","shreya","adil"],
    "dept":["BCA","MCA","MBA","DEVELOPER"],
    "marks":[99,88,95,97],
    "passed":[True,False,True,False],
    "subjects":["CN","OS","DBMS","HTML"]
}
df=pd.DataFrame(data)
print(df[0:3])

        name dept  marks  passed subjects
0  vaishnavi  BCA     99    True       CN
1     tanuja  MCA     88   False       OS
2     shreya  MBA     95    True     DBMS

### get the data type of each coloumn

In [281]:
data={
    "name":["vaishnavi","tanuja","shreya","adil"],
    "dept":["BCA","MCA","MBA","DEVELOPER"],
    "marks":[99,88,95,97],
    "passed":[True,False,True,False],
    "subjects":["CN","OS","DBMS","HTML"]
}
df=pd.DataFrame(data)
print(df.dtypes)

name        object
dept        object
marks        int64
passed        bool
subjects    object
dtype: object

### show the summary statistics of the dataframe

In [282]:
data={
    "name":["vaishnavi","tanuja","shreya","adil","raj"],
    "dept":["BCA","MCA","MBA","DEVELOPER","MBA"],
    "marks":[99,88,95,97,78],
    "passed":[True,False,True,False,False],
    "subjects":["CN","OS","DBMS","HTML","OS"]
}
df=pd.DataFrame(data)
print(df.describe())

           marks
count   5.000000
mean   91.400000
std     8.561542
min    78.000000
25%    88.000000
50%    95.000000
75%    97.000000
max    99.000000

## grouping

In [283]:
print(df)

        name       dept  marks  passed subjects
0  vaishnavi        BCA     99    True       CN
1     tanuja        MCA     88   False       OS
2     shreya        MBA     95    True     DBMS
3       adil  DEVELOPER     97   False     HTML
4        raj        MBA     78   False       OS

In [284]:
avg_marks=df.groupby("dept")["marks"].mean()
print(avg_marks)

dept
BCA          99.0
DEVELOPER    97.0
MBA          86.5
MCA          88.0
Name: marks, dtype: float64

In [285]:
no_of_std=df.groupby("dept")["name"].count()
print(no_of_std)

dept
BCA          1
DEVELOPER    1
MBA          2
MCA          1
Name: name, dtype: int64

In [286]:
std_passed=df.groupby("dept")["passed"].sum()
print(std_passed)

dept
BCA          1
DEVELOPER    0
MBA          1
MCA          0
Name: passed, dtype: int64

## add new coloumn based on condition

In [287]:
df["grades"]=["A" if marks>90 else "B" for marks in df["marks"]]
print(df)

        name       dept  marks  passed subjects grades
0  vaishnavi        BCA     99    True       CN      A
1     tanuja        MCA     88   False       OS      B
2     shreya        MBA     95    True     DBMS      A
3       adil  DEVELOPER     97   False     HTML      A
4        raj        MBA     78   False       OS      B

In [288]:
df.to_csv("students_details.csv",index=False)

In [289]:
df.to_html("students_details.html")

In [290]:
loaded_df=pd.read_csv("laptop_data_100.csv")

In [291]:
print(loaded_df)

      Brand   RAM    Processor  Price (INR)
0    Lenovo  32GB     Intel i3       111771
1        HP   4GB  AMD Ryzen 7        55518
2      Asus   8GB     Intel i3       146392
3   Samsung  16GB     Intel i7        66439
4   Samsung   4GB     Apple M1       134511
..      ...   ...          ...          ...
95    Apple   4GB     Intel i3        54382
96       HP  16GB     Intel i7        31901
97      MSI  32GB  AMD Ryzen 7        72488
98      MSI  16GB     Intel i5        57212
99     Asus  32GB     Intel i5       135270

[100 rows x 4 columns]

In [292]:
loaded_df.head()

     Brand   RAM    Processor  Price (INR)
0   Lenovo  32GB     Intel i3       111771
1       HP   4GB  AMD Ryzen 7        55518
2     Asus   8GB     Intel i3       146392
3  Samsung  16GB     Intel i7        66439
4  Samsung   4GB     Apple M1       134511

##  print Samsung laptops priced between  50000 to 70000

In [293]:
samsung_filtered = loaded_df[(loaded_df['Brand'] == 'Samsung') & 
                             (loaded_df['Price (INR)'] >= 50000) & 
                             (loaded_df['Price (INR)'] <= 70000)]
print(samsung_filtered)

      Brand   RAM    Processor  Price (INR)
3   Samsung  16GB     Intel i7        66439
53  Samsung   4GB     Intel i9        56269
76  Samsung   4GB  AMD Ryzen 5        66345
87  Samsung  16GB     Intel i7        51176

##  total price of lenovo company laptops whose price is between  50k and 1lkah

In [294]:
lenovo_total = loaded_df[
    (loaded_df['Brand'] == 'Lenovo') & 
    (loaded_df['Price (INR)'] >= 50000) & 
    (loaded_df['Price (INR)'] <= 100000)
]['Price (INR)'].sum()

print("Total Lenovo Price rs50,000 rs1,00,000:", lenovo_total)

Total Lenovo Price rs50,000 rs1,00,000: 158858